todo.org
* Inbox
** [ ] Implement insert-chars
SCHEDULED: <2021-03-23 Tue>

[[file:~/Workspace/journal.org::*\[2021-03-24 Wed 00:11\] This morning][[2021-03-24 Wed 00:11] This morning]]
** [ ] Game development Sandbox
DEADLINE: <2021-03-31 Wed> SCHEDULED: <2021-03-17 Wed>

Very simple toolbox for playing around with turn-based, Euro-style Games.
** [X] Fix launch install
SCHEDULED: <2021-03-23 Tue>
:LOGBOOK:
CLOCK: [2021-03-23 Tue 11:09]--[2021-03-23 Tue 11:13] =>  0:02
:END:
** [X] Fix time in container
SCHEDULED: <2021-03-23 Tue>
:LOGBOOK:
CLOCK: [2021-03-23 Tue 11:00]--[2021-03-23 Tue 11:09] => -7:08
:END:

[[file:~/Workspace/journal.org::*\[2021-03-24 Wed 00:11\] This morning][[2021-03-24 Wed 00:11] This morning]]
** [X] Try out NixOS on WSL 2.
SCHEDULED: <2021-03-23 Tue>
:LOGBOOK:
CLOCK: [2021-03-23 Tue 11:13]--[2021-03-23 Tue 11:20] =>  0:01
:END:
Found out WSL2 also does not support systemd natively. This is also not worth worrying about.
The above fix for time in container is satisfactory for now.

[[file:~/Workspace/journal.org::*\[2021-03-24 Wed 00:11\] This morning][[2021-03-24 Wed 00:11] This morning]]
** [X] Write windows install instructions
SCHEDULED: <2021-03-23 Tue>
:LOGBOOK:
CLOCK: [2021-03-23 Tue 11:21]--[2021-03-23 Tue 12:46] =>  1:25
:END:

[[file:~/Workspace/journal.org::*\[2021-03-24 Wed 00:11\] This morning][[2021-03-24 Wed 00:11] This morning]]
** DONE Get Sandbox running with Windows
SCHEDULED: <2021-03-18 Thu>
