todo.md

# Table of Contents

1.  [Inbox](#org0e6b066)
    1.  [Implement insert-chars](#orgf4fc758)
    2.  [Game development Sandbox](#org19a983d)
    3.  [Fix launch install](#org50de84f)
    4.  [Fix time in container](#orgf820a1e)
    5.  [Try out NixOS on WSL 2.](#orgc89893c)
    6.  [Write windows install instructions](#org5c329ed)
    7.  [Get Sandbox running with Windows](#org6b60a3f)


<a id="org0e6b066"></a>

# Inbox


<a id="orgf4fc758"></a>

## [ ] Implement insert-chars

[[2021-03-24 Wed 00:11] This morning](file:///home/john/Workspace/journal.md)


<a id="org19a983d"></a>

## [ ] Game development Sandbox

Very simple toolbox for playing around with turn-based, Euro-style Games.


<a id="org50de84f"></a>

## [X] Fix launch install


<a id="orgf820a1e"></a>

## [X] Fix time in container

[[2021-03-24 Wed 00:11] This morning](file:///home/john/Workspace/journal.md)


<a id="orgc89893c"></a>

## [X] Try out NixOS on WSL 2.

Found out WSL2 also does not support systemd natively. This is also not worth worrying about.
The above fix for time in container is satisfactory for now.

[[2021-03-24 Wed 00:11] This morning](file:///home/john/Workspace/journal.md)


<a id="org5c329ed"></a>

## [X] Write windows install instructions

[[2021-03-24 Wed 00:11] This morning](file:///home/john/Workspace/journal.md)


<a id="org6b60a3f"></a>

## DONE Get Sandbox running with Windows

